from db import SessionLocal, init_db
from models import Client, Exercise, Program, Course

# Ініціалізація бази та таблиць
init_db()

db = SessionLocal()

# Створимо тестового клієнта
client = Client(
    name="Михайло Зябров",
    phone="+380635048182",
    symptoms="Біль у попереку та шиї",
    activities="Спорт",
    research_results="Лівосторонній сколіоз",
    massage_recommendations="Глибокотканний масаж",
    age=35,
    telegram_id=291651795
)

print(' ✅ Тестовий клієнт доданий')

course = Course(name="Д/З", description="""⭐️Методичні рекомендації з виконання вправ за системою ORTHO SPIN у домашніх умовах 

Загальні положення
Система ORTHO SPIN спрямована на відновлення функцій хребта при різних патологіях. Багато оздоровчих центрів пропонують загальні заняття, що покращують загальний стан здоров'я, але не враховують індивідуальні особливості та наявні патології. У результаті людина може відчувати тимчасове полегшення, але хронічний біль зберігається.
На відміну від загальних тренувань, система ORTHO SPIN спрямована на цілеспрямоване відновлення хребта при радикуліті, протрузіях, порушенні постави, грижах міжхребцевих дисків тощо. Унікальність методу – можливість ефективного відновлення в будь-якому віці. 

Основні правила виконання вправ:
• Строга послідовність і техніка – запорука ефективного відновлення.
• Вправи враховують фізіологічні особливості та різні види патологій.
• Дихання, напруження та розслаблення – ключові елементи виконання.
• Виконувати вправи можна як окремі процедури або в складі комплексного заняття. 

Протипоказання та запобіжні заходи:
• Вправи дозволені лише після консультації зі спеціалістом ORTHO SPIN.
• При гострому болю заборонені вправи у положенні сидячи або стоячи.
• Виконання можливе лише лежачи або в колінно-ліктьовому положенні.
• Перехід до сидячих вправ можливий лише після зняття болю та адаптації тіла.
• Недотримання цих правил може погіршити стан здоров'я. 

Гігієна хребта та обов’язкові вправи:
• Вправи на розслаблення та розтягнення необхідно виконувати щодня ввечері.
• Для дорослих – після роботи, для дітей – після уроків.
• Це основа гігієни хребта, рівнозначна чищенню зубів. 

Система ORTHO SPIN – це не просто комплекс вправ, а цілісна методика відновлення здоров'я хребта, що допомагає зняти біль, покращити поставу та підвищити якість життя.""")


test_program = Program()

# Створимо тестову вправу
exercise = Exercise(
    name="Потягушки на спині №1",
    description="""- Вихідне положення – лежачи на спині, руки випрямлені за головою.
    - На вдиху максимально тягнемося руками, а стопи тягнемо на себе.
    - На видиху – повне розслаблення.

    Повторити 10 разів.""",
    tags="спина, розтяжка",
    media_url='AgACAgIAAxkBAAMoaMZmX6ak2-nEP9IGyGOP0dprJ4kAAmXmMRsjymFKFQWIIY_Faz4BAAMCAAN5AAM2BA',
)

db.add(client)
db.add(exercise)
db.add(course)
db.add(test_program)

# Прикріпимо вправу до курсу
exercise.course_id = course.id

# Прикріпимо вправу до програми
test_program.exercises.append(exercise)

# Прикріпимо програму до клієнта
client.programs.append(test_program)

db.commit()

print("✅ Тестові дані додані")
